barryblueice/ESP32-Haptic-Precision-TouchPad/Main/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 6.0.0 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
CONFIG_TINYUSB_SUSPEND_CALLBACK=y
CONFIG_TINYUSB_RESUME_CALLBACK=y
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_CUSTOM_VID=0xd00
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x72c
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="R-SODIUM Technology"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="R-SODIUM Haptic TouchPad"
CONFIG_TINYUSB_DESC_SERIAL_STRING="0D00072C00000000"
CONFIG_TINYUSB_HID_COUNT=3
